Revit 2027 API
StairsPathType.StartExtension Property
 The start extension length of the stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StartExtension { get; set; }
Public Property StartExtension As Double
	Get
	Set
public:
property double StartExtension {
	double get ();
	void set (double value);
}
member StartExtension : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for startExtension must be between 0 and 30000 feet.
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace